package main

// https://leetcode-cn.com/problems/gray-code

// ❓ 格雷编码
// ⚠️ 自身 xor 自身>>1
func grayCode(n int) []int {
	var nums []int
	for num := 0; num < 1<<n; num++ {
		nums = append(nums, num^(num>>1))
	}
	return nums
}

// 映射唯一
// g ^ num = g ^ num>>1 = num ^ num>>1
// 即
// x^1 = x^0 , x = 1
// x^2 = x^1 , x = 3
// x^3 = x^1 , x = 2
// x^4 = x^2 , x = 6
// x^5 = x^2 , x = 7

// 仅差一位
// 末尾连续 1 变 0
// 最低位 0 变 1

// 0000 0000 0000
// 0001 0000 0001 +1
// 0010 0001 0011 完全进位
// 0011 0001 0010 +1
// 0100 0010 0110 完全进位
// 0101 0010 0111 +1
// 0110 0011 0101 进位
// 0111 0011 0100 +1
// 1000 0100 1100 完全进位
// 1001 0100 1101 +1
// 1010 0101 1111 进位
// 1011 0101 1110 +1
// 1100 0110 1010 进位
// 1101 0110 1011 +1
// 1110 0111 1001 进位
// 1111 0111 1000 +1
// 10000 01000 11000 完全进位
